/*
					ТУЕС (Технологично училище Електронни системи към ТУ София)
										http://www.elsys-bg.org/
											11 Б клас 
											Номер 9
											Георги Кръчков
										
Да се разработи програма,  която изисква от потребителя да въведе четири числа x, y, w, h където x>0,
y>0, w>0, h>0. Числото x е дължината на плоча дървесина, а числото y е височината. Да се определи на колко
цели плочи с размери w, h може да се разреже голямата плоча. Да се инициализира масив от 10 елемента. 
Стойностите на елементите на масива да са първите 10 координати по дължина на плочата, в които тя трябва 
да се разреже, за да се получат по-малките плочи.
*/

#include <stdio.h>
int main ()
{
	float x, y, w, h, s1, s2, a=0, b=0;
	int z=0, i=0, n;
	float arr[10][2];
   
	printf("Vavedete X\n");
	scanf("%f",&x);          
	printf("Vavedete Y\n");
	scanf("%f",&y); 
	printf("Vavedete W\n");
	scanf("%f",&w);
	printf("Vavedete H\n");
	scanf("%f",&h);
	
	s1 = x*y;
	s2 = w*h;
   
	for (s1 = x*y; s2 <= s1;i++)
	{
		n = 0;	
		if (((x>=w)&&(y>=h))||((y>=w)&&(x>=h)))
		{
			++z;
		}
		arr[i][0]= w+a;
		arr[i][1]= h+b;
		if (w+w<=x) 
		{
			a = a + w;
			n = 1;
		}
		if ((h+h<=y)&&(n != 1)) 
		{
			b = b + w;
		}
		s1 = s1-s2;
	}
	printf ("Broq na celite plochki e: %d\n",z);
	
	for (i = 0;((i<=9)&&(z!=0)); i++)
	{
		printf("X = %f, Y = %f\n",arr[i][0],arr[i][1]);
	}
	
	return 0;
}
