/*
					ТУЕС (Технологично училище Електронни системи към ТУ София)
										http://www.elsys-bg.org/
											11 Б клас 
											Номер 9
											Георги Кръчков
										
Да се разработи програма, която изисква от потребителя да въведе целочислено число х, където 0<x<10. 
Да се инициализира масив от 10 елемента. Да се намери сумата от cos(z) за всяко z в интервала [0;x) и да 
се запише като първи елемент в масива. Да се намери сумата от cos(z) за всяко z в интервала [x; 2x) и да 
се запише като втори елемент в масива. Аналогично да се намерят сумите на cos(z) за всички интервали 
[Nx; (N+1)x ) и да се запишат като елемент N в масива за всяко N в интервала [0, 10). Масивът да се изведе
на стандартния изход.
*/

#include<stdio.h>
#include<math.h>
 
main()
{
	int x,y,i,z,n = 0;
	float arr[10];
	float a = 0.0;
   
	printf("Vavedete chisloto\n");
	scanf("%d",&x);
   
	for(i = 0; i < 10; i++)
	{
		for(z=x*n; (z < (n+1)*x); z++)
		{
			a = a + cos(z);
		}
		arr[i] = a; 
		n = n+1;
	}
   
	for(i=0; i < 10; i++)
	{
		printf("Arr{%d} : %f\n", i, arr[i]);
	}
	
	return 0;
}
