/*
					ТУЕС (Технологично училище Електронни системи към ТУ София)
										http://www.elsys-bg.org/

Да се разработи програма, която изисква от потребителя да въведе целочислено число x, където 0<x<10. 
Да се инициализира масив от 10 елемента. Да се намери първото число N в интервала [0; +?) делящо се на х.
Да се намери сумата на всички числа в интервала [0; N] и да се запише като първи елемент в масива. Да се 
намери второто число N' в интервала [0; +?) делящо се на x. Да се намери сумата на всички числа в 
интервала [0, N'] и да се запише като втори елемент в масива. Аналогично да се запълнят и останалите 
елементи на масива. Масивът да се изведе на стандартния изход.										
*/

#include<stdio.h>
 
main()
{
	int a, i, x, z=0;
	int arr[10];
  
	printf("Vavedete chislo: \n");
	scanf("%d",&x);

	for (a=0; a<10; a++)
	{
    	for (i=0, z=0; i <= x ; i++)
		{
			z = z + i;
		}
		arr[a] = z;
		x = x + x;
	}
	
	for(i=0; i < 10; i++)
	{
		printf("Arr[%d] : %d\n", i, arr[i]);
	}
	
	return 0;
}
