/*
					ТУЕС (Технологично училище Електронни системи към ТУ София)
										http://www.elsys-bg.org/
											11 Б клас 
											Номер 9
											Георги Кръчков
										
Да се разработи програма, която изисква от потребителя да въведе целочислено число x, където 0<x<10. 
Да се инициализира масив от 10 елемента. Да се намери сумата от всички числа в интервала [0; 1000) делящи 
се на x и да се запише като първа стойност в масива. Да се намери сумата от всички числа в интервала 
[0;1000) деляща се на 2x и да се запише като втора стойност в масива. Аналогично да се намери сумата на 
всички числа делящи се на Nx за N в интервала [1;10] и да се запишат като елемент N-1 в масива. Масивът 
да се изведе на стандартния изход.										
*/

#include<stdio.h>
 
main()
{
	int a, i, n, x, z;
	int arr[10];
  
	printf("Vavedete chislo: \n");
	scanf("%d",&x);
  
	for (i=1; i<=10; i++)
	{
		for(a=0, z=0; a<1000; a++)
		{
			if ((a%(x*i))==0)
			{
				z = z + a;
			}
		}
		arr[i-1]=z;
	}
	
	for(i=0; i < 10; i++)
	{
		printf("Arr[%d] : %d\n", i, arr[i]);
	}
	
	return 0;
}
