/*
					ТУЕС (Технологично училище Електронни системи към ТУ София)
										http://www.elsys-bg.org/

Да се разработи програма, която изисква от потребителя да въведе целочислено число x, където 0<x<10. 
Да се инициализира масив от 10 елемента. Да се намери първото число на Фибоначи в интервала [0; +?) 
завършващо на x и да се запише като първи елемент в масива. Да се намери второто число на Фибоначи в 
интервала [0;  +?) завършващо на x и да се запише като втори елемент в масива. Аналогично да се намерят 
първите N прости числа в интервала [0;  +?) и да се запишат като елемент N в масива. Масивът да се изведе 
на стандартния изход.										
*/

#include<stdio.h>

int main()
{
	int x, i, z, n;
	int arr[10];
   
	printf("Vavedete chislo\n");
	scanf("%d",&x);
   
	for(i = 0, n = 0; n <= 9; i++)
	{
		z = fibonacci(i);
		if (z%10 == x)
		{
			arr[n] = z;
			++n;
		}	
	}
   
	for (i=0; i<10; i++)
	{
		printf ("Arr[%d]: %d\n",i , arr[i]);
	}
   
   return 0;
}
int fibonacci(int n)
{
	int a = 0;
	int b = 1;
	int sum;
	int i;

	for (i=0;i<n;i++)
	{
		sum = a + b;
		a = b;
		b = sum;
	}
	
	return a;
}
