/*
					ТУЕС (Технологично училище Електронни системи към ТУ София)
										http://www.elsys-bg.org/
											11 Б клас 
											Номер 9
											Георги Кръчков
										
Да се разработи програма, която изисква от потребителя да въведе целочислено число x, където x e интервала
[0; +?). Да се намерят първите 10 нечетни числа делители на x и да се запишат в масив. Масивът да се 
изведе на екрана и да се намерят простите числа в този масив.										
*/

#include<stdio.h>

int main()
{
	int x, i, n;
	int arr[10];

	printf("Vavedete chislo\n");
	scanf("%d",&x);
	
	for(i = 1, n = 0; n <= 9; i++)
	{
		if ((x%i==0)&&(i%2==1))
		{
			arr[n] = i;
			printf("%d\n",i);
			++n;
		}
	}
	
	for (i=0; i<10; i++)
	{
		printf ("Arr[%d]: %d\n",i , arr[i]);
	}
 
	return 0;
}
