/*
					ТУЕС (Технологично училище Електронни системи към ТУ София)
										http://www.elsys-bg.org/
											11 Б клас 
											Номер 9
											Георги Кръчков
										
Да се разработи програма, която изисква от потребителя да въведе целочислено число x, където 0<x<10. 
Да се инициализира масив от 100 целочислени елемента. Стойностите на елементите да са случайни числа 
в интервала [0, 100). Елементите на масива да се подредят така, че числата завършващи на x да са в 
началото.

*/
#include<stdio.h>

main()
{
	int arr[100];
	int x, i, y;
   
	printf("Vavedete chisloto\n");
	scanf("%d",&x);

	for (i = 0; i <= 99; i++)
	{
		arr[i] = (random(100)%100);
	}
	
	for (i = 0; i <= 99; i++)
	{
		if (arr[i]%10 == x)
		{
			printf("%d\n", arr[i]);
		}
	} 
	
	for (i = 0; i <= 99; i++)
	{
		if (arr[i]%10 != x)
		{
			printf("%d\n", arr[i]);
		}
	}
	
	return 0;
}
