/*
					ТУЕС (Технологично училище Електронни системи към ТУ София)
										http://www.elsys-bg.org/

Да се разработи програма, която изисква от потребителя да въведе целочислено число x, където 0<=x<10. 
Да се инициализира масив от 10 елемента. Да се намерят първите 10 стойности на функцията cos(x) 
в интервала [0; +?), в които третата цифра след десетичната запетая е x. Пример при cos(1) = 0.540302306 
третата цифра след десетичната запетая е 0. При cos(2) = -0.416146837 третата цифра след десетичната 
запетая е 6. Намерените стойности да се зададат като стойности на елементите в масива. Елементите на 
масива да се изведат на стандартния изход.										
*/

#include<stdio.h>
#include<math.h>

int transformation(float input); 

main()
{
	int x,y,i,z,n = 0;
	float arr[10];
	float a = 0.0;
 
	printf("Vavedete chisloto\n");
	scanf("%d",&x);
	
	for(i=0, n=0; n<10; i++)
	{
		if (transformation(cos(i)) == x)
		{
			arr[n] = cos(i);
			++n;
		}
	}
   
	for(i=0; i < 10; i++)
	{
		printf("Arr{%d} : %f\n", i, arr[i]);
	}
   
	return 0;
}
int transformation(float input)
{
	input *= 1000.0;
	int output = (int) input;
   
	return output % 10;
}
